<template>
  <section class="about-section">
    <div id="about" class="container">
      <h1>О Нас - Пиццерия "MarioPizza"</h1>

      <!-- История -->
      <div class="section">
        <h2>Наша История</h2>
        <p>
          Добро пожаловать в "MarioPizza"! Мы начали свою историю 15 лет назад, когда два друга, Марко и Джузеппе,
          решили привнести в свой город аутентичные итальянские вкусы. Оба выросли в Италии и с детства знали, что
          настоящая пицца - это искусство. После переезда в другой город, они заметили, что нигде не найти пиццы,
          такой же вкусной, как дома, и решили исправить это.
        </p>
      </div>

      <!-- Команда -->
      <div class="section">
        <h2>Наша Команда</h2>
        <p>
          Наши повара обучались в Италии и имеют многолетний опыт работы в лучших пиццериях. Шеф-повар Марко известен
          своим талантом создавать креативные комбинации ингредиентов, а Джузеппе мастерски управляет кухней и отвечает
          за непревзойденное качество каждой пиццы. Они собрали команду единомышленников, которые горят своим делом и
          готовы делиться своим мастерством с каждым гостем.
        </p>
      </div>

      <!-- Философия -->
      <div class="section">
        <h2>Наша Философия</h2>
        <p>
          Мы в "MarioPizza" верим, что основа хорошей пиццы - это высококачественные ингредиенты, традиционные рецепты
          и любовь к своему делу. Мы используем только свежие овощи, лучшие сыры и натуральные соусы, чтобы наша пицца
          всегда была наивкуснейшей. Тесто мы замешиваем вручную, по классическому итальянскому рецепту, чтобы каждая
          корочка была идеальной.
        </p>
      </div>

      <!-- Устойчивое Развитие -->
      <div class="section">
        <h2>Устойчивое Развитие</h2>
        <p>
          Мы заботимся о планете и стараемся минимизировать наш экологический след. В нашей пиццерии используется
          минимальное количество пластика, мы сортируем отходы и поддерживаем местные фермерские хозяйства, закупая у
          них продукты. Мы верим, что вкусная еда должна быть не только приятной, но и ответственной.
        </p>
      </div>

      <!-- Взаимодействие с Сообществом -->
      <div class="section">
        <h2>Взаимодействие с Сообществом</h2>
        <p>
          Мы ценим наше сообщество и всегда готовы поддержать местные инициативы. Мы часто участвуем в благотворительных
          мероприятиях и предоставляем пиццу для детских праздников и спортивных соревнований. Мы хотим, чтобы "MarioPizza"
          была не просто местом, где можно поесть, но и важной частью жизни нашего города.
        </p>
      </div>

      <!-- Уникальные Предложения -->
      <div class="section">
        <h2>Уникальные Предложения</h2>
      </div>
      <p>Приходите в "MarioPizza", чтобы попробовать нашу вкусную пиццу и стать частью нашей дружной семьи. Мы ждем вас!</p>
    </div>
  </section>
</template>

<style scoped>
.about-section {
  background-size: cover;
  background-position: center;
  background-repeat: no-repeat;
  background-attachment: fixed;
  padding: 2rem;
  color: #ffffff;
  font-family: 'Roboto Light', sans-serif;
}

.container {
  max-width: 800px; /* Ограничиваем ширину содержимого */
  margin: 0 auto;   /* Центрируем по горизонтали */
  border: 1px solid #000000;
  border-radius: 10px;
  background: rgba(255, 255, 255, 0.52);
  padding: 5px;
}
.container p {

}
h1 {
  font-size: 2.3rem; /* Размер заголовка */
  color: black;     /* Цвет текста */
  text-align: center; /* Центрируем заголовок */
}

h2 {
  font-size: 1.7rem; /* Размер подзаголовка */
  color: black;     /* Цвет текста */
}

.section {
  margin-bottom: 1.7rem; /* Отступ между секциями */
}

p {
  line-height: 1.6; /* Межстрочный интервал для читабельности */
  font-size: 1.3rem;
  color: black;      /* Цвет текста */
}
</style>

<script setup>
</script>